print("ตรวจสอบเกรด")
a = int(input('โปรดกรอกข้อมูล'))
if a < 0 or a > 100 :
    print('กรุณากรอก 0 - 100')
elif a >= 80 :
    print("คุณได้เกรด 4")
elif a >= 70 :
    print("คุณได้เกรด 3")
elif a >= 60 :
    print("คุณได้เกรด 2")
elif a >= 50 :
    print("คุณได้เกรด 1")
else :
    print('คุณได้เกรด 0')
    print('ต้องการแก้ หรือ ไม่แก้ ถ้าต้องการพิมพ์ 1 ไม่ต้องการพิมพ์ 2 ')
    c = int(input('กรอกตัวเลือก : '))
    if c == 1:
        a = 50 - a
        print(f'คุณขาดคะแนนอีก {a}')
    elif c == 2:
        print('สอบตกเหมือนเดิม')
    else:
        print('กรุณาเลือก 1 และ 2')