import random
print('โปรแกรมเป่ายิงฉุบ')
while True:
    a = random.choice(["ค้อน","กรรไกร","กระดาษ"])
    print(a)
    print('เลือก ค้อน กรรไกร กระดาษ')
    b = str(input("คุณเลือก :"))
    if b == a :
        print("ผลลัพธ์คือ เสมอ")
        print("--------------------------")
    elif a == "กรรไกร" and b == "ค้อน" :
        print ("ผลลัพธ์คือ คุณชนะ")
        print("--------------------------")
    elif a == "ค้อน" and b == "กระดาษ" :
        print ("ผลลัพธ์คือ คุณชนะ")
        print("--------------------------")
    elif a == "กระดาษ" and b == "กรรไกร" :
        print ("ผลลัพธ์คือ คุณชนะ")
        print("--------------------------")
    else :
        print("ผลลัพธ์คือ คุณแพ้")
        print("--------------------------")
